tests/performance/results/TASK-007/00-smoke-warmup.txt


  █ TOTAL RESULTS 

    checks_total.......: 400     132.977197/s
    checks_succeeded...: 100.00% 400 out of 400
    checks_failed......: 0.00%   0 out of 400

    ✓ detail: correct id
    ✓ detail: seeded version

    CUSTOM
    unexpected_errors..............: 0.00%  0 out of 200

    HTTP
    http_req_duration..............: med=10.29ms p(95)=14.18ms
      { expected_response:true }...: med=10.29ms p(95)=14.18ms
    http_req_failed................: 0.00%  0 out of 201
    http_reqs......................: 201    66.821042/s

    EXECUTION
    iteration_duration.............: med=10.53ms p(95)=14.33ms
    iterations.....................: 200    66.488599/s
    vus............................: 1      min=1        max=1
    vus_max........................: 1      min=1        max=1

    NETWORK
    data_received..................: 167 kB 55 kB/s
    data_sent......................: 37 kB  12 kB/s