tests/performance/results/TASK-007/00-smoke.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /perf/workload.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 1 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
default   [   3% ] 1 VUs  01.0s/30s

running (0m02.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
default   [   7% ] 1 VUs  02.0s/30s

running (0m03.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
default   [  10% ] 1 VUs  03.0s/30s

running (0m04.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
default   [  13% ] 1 VUs  04.0s/30s

running (0m05.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
default   [  17% ] 1 VUs  05.0s/30s

running (0m06.0s), 1/1 VUs, 19 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  06.0s/30s

running (0m07.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
default   [  23% ] 1 VUs  07.0s/30s

running (0m08.0s), 1/1 VUs, 24 complete and 0 interrupted iterations
default   [  27% ] 1 VUs  08.0s/30s

running (0m09.0s), 1/1 VUs, 27 complete and 0 interrupted iterations
default   [  30% ] 1 VUs  09.0s/30s

running (0m10.0s), 1/1 VUs, 30 complete and 0 interrupted iterations
default   [  33% ] 1 VUs  10.0s/30s

running (0m11.0s), 1/1 VUs, 33 complete and 0 interrupted iterations
default   [  37% ] 1 VUs  11.0s/30s

running (0m12.0s), 1/1 VUs, 36 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  12.0s/30s

running (0m13.0s), 1/1 VUs, 38 complete and 0 interrupted iterations
default   [  43% ] 1 VUs  13.0s/30s

running (0m14.0s), 1/1 VUs, 42 complete and 0 interrupted iterations
default   [  47% ] 1 VUs  14.0s/30s

running (0m15.0s), 1/1 VUs, 45 complete and 0 interrupted iterations
default   [  50% ] 1 VUs  15.0s/30s

running (0m16.0s), 1/1 VUs, 48 complete and 0 interrupted iterations
default   [  53% ] 1 VUs  16.0s/30s

running (0m17.0s), 1/1 VUs, 51 complete and 0 interrupted iterations
default   [  57% ] 1 VUs  17.0s/30s

running (0m18.0s), 1/1 VUs, 54 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  18.0s/30s

running (0m19.0s), 1/1 VUs, 58 complete and 0 interrupted iterations
default   [  63% ] 1 VUs  19.0s/30s

running (0m20.0s), 1/1 VUs, 61 complete and 0 interrupted iterations
default   [  67% ] 1 VUs  20.0s/30s

running (0m21.0s), 1/1 VUs, 63 complete and 0 interrupted iterations
default   [  70% ] 1 VUs  21.0s/30s

running (0m22.0s), 1/1 VUs, 66 complete and 0 interrupted iterations
default   [  73% ] 1 VUs  22.0s/30s

running (0m23.0s), 1/1 VUs, 71 complete and 0 interrupted iterations
default   [  77% ] 1 VUs  23.0s/30s

running (0m24.0s), 1/1 VUs, 74 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  24.0s/30s

running (0m25.0s), 1/1 VUs, 77 complete and 0 interrupted iterations
default   [  83% ] 1 VUs  25.0s/30s

running (0m26.0s), 1/1 VUs, 80 complete and 0 interrupted iterations
default   [  87% ] 1 VUs  26.0s/30s

running (0m27.0s), 1/1 VUs, 84 complete and 0 interrupted iterations
default   [  90% ] 1 VUs  27.0s/30s

running (0m28.0s), 1/1 VUs, 88 complete and 0 interrupted iterations
default   [  93% ] 1 VUs  28.0s/30s

running (0m29.0s), 1/1 VUs, 92 complete and 0 interrupted iterations
default   [  97% ] 1 VUs  29.0s/30s

running (0m30.0s), 1/1 VUs, 95 complete and 0 interrupted iterations
default   [ 100% ] 1 VUs  30.0s/30s


  █ THRESHOLDS 

    checks
    ✓ 'rate==1.0' rate=100.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=16.53ms
    ✓ 'p(99)<1000' p(99)=80.13ms

    unexpected_errors
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 309     10.265076/s
    checks_succeeded...: 100.00% 309 out of 309
    checks_failed......: 0.00%   0 out of 309

    ✓ employee list: first page
    ✓ employee list: exactly own 120
    ✓ employee list: only own rows
    ✓ approver list: status filter holds
    ✓ approver list: department filter holds
    ✓ approver list: keyword filter holds
    ✓ approver list: page metadata consistent
    ✓ detail: correct id
    ✓ detail: seeded version
    ✓ workflow: created DRAFT v0
    ✓ workflow: edited v1
    ✓ workflow: submitted PENDING v2
    ✓ workflow: decided v3
    ✓ workflow: detail shows final state
    ✓ workflow: stale approve is 409 version conflict

    CUSTOM
    expected_conflicts.............: 4      0.132881/s
    unexpected_errors..............: 0.00%  0 out of 188

    HTTP
    http_req_duration..............: avg=12.24ms  min=4.94ms   med=11.17ms  p(90)=15.19ms  p(95)=16.53ms  p(99)=80.13ms  max=145.13ms
      { expected_response:true }...: avg=11.89ms  min=4.94ms   med=11.22ms  p(90)=15.1ms   p(95)=16.5ms   p(99)=49.05ms  max=145.13ms
    http_req_failed................: 2.11%  4 out of 189
    http_reqs......................: 189    6.278639/s

    EXECUTION
    iteration_duration.............: avg=313.41ms min=112.77ms med=283.66ms p(90)=478.08ms p(95)=493.66ms p(99)=532.46ms max=547.26ms
    iterations.....................: 96     3.18915/s
    vus............................: 1      min=1        max=1
    vus_max........................: 1      min=1        max=1

    NETWORK
    data_received..................: 251 kB 8.3 kB/s
    data_sent......................: 52 kB  1.7 kB/s



running (0m30.1s), 0/1 VUs, 96 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  30s